
&НаКлиенте
Процедура ПересчетДатаОкончания()
	Объект.ДатаОкончания =  ДобавитьМесяц(Объект.ДатаАктивации, Объект.СрокДействия) + (Объект.Заморозки.Итог("ДнейЗаморозки") * 86400);	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДОстатокДнейЗаморозки()
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки  - Объект.Заморозки.Итог("ДнейЗаморозки");
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДатТЧ()
	
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;
	РасчетДней = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала) / 86400;
	СтрокаТЧ.ДнейЗаморозки = 0;
	ПересчетДОстатокДнейЗаморозки();
	
	Если РасчетДней > Объект.ОстатокДнейЗаморозки Тогда
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + (Объект.ОстатокДнейЗаморозки * 86400);
		СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала) / 86400;
	Иначе
		СтрокаТЧ.ДнейЗаморозки = РасчетДней;
	КонецЕсли;	
		
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ДатаАктивацииПриИзменении(Элемент)
		ПересчетДатаОкончания(); 
	КонецПроцедуры
	
	&НаКлиенте
	Процедура СрокДействияПриИзменении(Элемент)
		ПересчетДатаОкончания();
		АвтоНаименование();
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ДнейЗаморозкиПриИзменении(Элемент)
		ПересчетДОстатокДнейЗаморозки(); 
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ЗаморозкиДатаНачалаПриИзменении(Элемент)	
		ПересчетДатТЧ();
		ПересчетДатаОкончания();
		ПересчетДОстатокДнейЗаморозки();
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
		ПересчетДатТЧ();
		ПересчетДатаОкончания();
		ПересчетДОстатокДнейЗаморозки();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура АвтоНаименование()
		СклонениеМесяца = "";
		Если Объект.СрокДействия = 1 Тогда
			СклонениеМесяца = "месяц";
		ИначеЕсли Объект.СрокДействия = 2 ИЛИ Объект.СрокДействия = 3 ИЛИ Объект.СрокДействия = 4 Тогда
			СклонениеМесяца = "месяца"; 
		Иначе
			СклонениеМесяца = "месяцев";
		КонецЕсли;
		
		Объект.Наименование = СтрШаблон(" %1 ( %2 на %3 %4)", Объект.Владелец, Объект.Номенклатура, Объект.СрокДействия, СклонениеМесяца); 	
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВладелецПриИзменении(Элемент)
		АвтоНаименование();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура НоменклатураПриИзменении(Элемент)
		АвтоНаименование();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ЗаморозкиДнейЗаморозкиПриИзменении(Элемент)
		ПересчетДатаОкончания();
		ПересчетДОстатокДнейЗаморозки();
	КонецПроцедуры
