
&НаКлиенте
Процедура УстановкаПравилОтображения()
	
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Абонемент.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.Наименование.Заголовок = "ФИО";
	Иначе
		Элементы.Абонемент.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь;
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаПравилОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановкаПравилОтображения();
КонецПроцедуры
