&НаКлиенте
Процедура УстановкаПравилОтображения() 
	
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Объект.ДатаОкончания = "0001,01,01";
		КонецЕсли;	
	Иначе 
		Элементы.ДатаОкончания.Видимость = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеНаименования()
		
	Если ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер + " от " + Формат(Объект.ДатаНачала,"ДЛФ=Д"); 
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Номер)И НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№ " + Объект.Номер; 
		
	Иначе 
		Объект.Наименование = "от " + Формат(Объект.ДатаНачала,"ДЛФ=Д");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	УстановкаПравилОтображения(); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ОбновлениеНаименования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ОбновлениеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ОбновлениеНаименования();
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановкаПравилОтображения();
КонецПроцедуры
