
&НаКлиенте
Процедура ОбновлениеНаименоваяФИО() 
	Объект.Наименование = Объект.Фамилия + " " + Объект.Имя + " "  + Объект.Отчество;
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент) 
	ОбновлениеНаименоваяФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновлениеНаименоваяФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновлениеНаименоваяФИО();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ОбновлениеНаименоваяФИО();
	КонецЕсли;
КонецПроцедуры
